[ { "name": "Economics", "definition": "The study of how individuals, firms, and governments make choices to allocate scarce resources in order to satisfy unlimited human wants and needs.", "example": "A government deciding whether to invest more in healthcare or education is practicing economics.", "category": "Basic Concepts" },
{ "name": "Scarcity", "definition": "The fundamental economic problem where limited resources cannot satisfy all human wants, necessitating trade-offs.", "example": "A drought limiting water supply for agriculture forces farmers to prioritize which crops to water.", "category": "Basic Concepts", "notes": "Scarcity is the basis for opportunity cost and resource allocation decisions." },
{ "name": "Choice", "definition": "The act of selecting among alternatives due to scarcity of resources.", "example": "A student choosing between studying economics or mathematics for a semester reflects economic choice.", "category": "Basic Concepts" }, 
{ "name": "Opportunity cost", "definition": "The value of the next best alternative forgone when making a decision.", "example": "If a factory uses its land to grow wheat instead of corn, the opportunity cost is the potential corn harvest lost.", "category": "Basic Concepts" },
{ "name": "Wants", "definition": "Goods or services that are desired but not essential for survival.", "example": "Buying the latest smartphone is a want rather than a need.", "category": "Basic Concepts" }, 
{ "name": "Needs", "definition": "Goods or services essential for basic human survival and well-being.", "example": "Food, water, and shelter are primary human needs.", "category": "Basic Concepts" }, 
{ "name": "Goods", "definition": "Tangible products that satisfy human wants or needs.", "example": "Books, clothing, and cars are examples of goods.", "category": "Basic Concepts" },
{ "name": "Services", "definition": "Intangible activities performed to satisfy human wants or needs.", "example": "Banking, teaching, and hairdressing are examples of services.", "category": "Basic Concepts" }, 
{ "name": "Factors of production", "definition": "The resources used to produce goods and services: land, labor, capital, and entrepreneurship.", "example": "A bakery uses flour (land), bakers (labor), ovens (capital), and a manager (entrepreneurship) to produce bread.", "category": "Factors of Production" }, 
{ "name": "Land", "definition": "Natural resources used in production, including soil, minerals, forests, and water.", "example": "A farm uses land to grow crops, which is a critical factor of production.", "category": "Factors of Production" },
{ "name": "Labor", "definition": "Human effort, both physical and mental, used in the production of goods and services.", "example": "Factory workers assembling cars provide labor in the production process.", "category": "Factors of Production" },
{ "name": "Capital", "definition": "Man-made resources used to produce goods and services, such as machinery, buildings, and tools.", "example": "A sewing machine in a textile factory represents capital used in production.", "category": "Factors of Production" }, 
{ "name": "Entrepreneurship", "definition": "The ability to combine other factors of production and take risks to create goods and services.", "example": "An individual starting a tech startup demonstrates entrepreneurship by innovating and organizing resources.", "category": "Factors of Production" }, 
{ "name": "Utility", "definition": "The satisfaction or benefit a person gains from consuming a good or service.", "example": "Eating an ice cream on a hot day provides utility to the consumer.", "category": "Basic Concepts" }, 
{ "name": "Marginal utility", "definition": "The additional satisfaction gained from consuming one more unit of a good or service.", "example": "Eating a second slice of pizza adds less satisfaction than the first, illustrating diminishing marginal utility.", "category": "Basic Concepts" },
{ "name": "Total utility", "definition": "The overall satisfaction obtained from consuming a certain quantity of goods or services.", "example": "Eating three slices of pizza may give a total utility of 30 units of satisfaction.", "category": "Basic Concepts" },
{ "name": "Diminishing marginal utility", "definition": "The principle that the additional satisfaction from consuming extra units of a good decreases as consumption increases.", "example": "The first sip of water quenches thirst greatly, but the fifth sip provides much less satisfaction.", "category": "Basic Concepts" }, 
{ "name": "Economic system", "definition": "A structured way in which a society organizes the production, distribution, and consumption of goods and services.", "example": "The United States has a mixed economy combining private enterprise with government regulation.", "category": "Economic Systems" },
{ "name": "Traditional economy", "definition": "An economic system in which customs, traditions, and beliefs shape production and distribution.", "example": "A rural village where families farm the same crops for generations follows a traditional economy.", "category": "Economic Systems" }, 
{ "name": "Market economy", "definition": "An economic system where decisions on production and consumption are driven by supply, demand, and price signals.", "example": "In the United States, most goods and services are allocated through market mechanisms.", "category": "Economic Systems" },
{ "name": "Command economy", "definition": "An economic system where the government controls production, distribution, and pricing decisions.", "example": "North Korea’s government dictates what goods are produced and at what price, characteristic of a command economy.", "category": "Economic Systems" }, 
{ "name": "Mixed economy", "definition": "An economic system combining elements of market and command economies, balancing private enterprise and government regulation.", "example": "France has a mixed economy, with private businesses operating alongside state-owned industries.", "category": "Economic Systems" }, 
{ "name": "Production", "definition": "The process of creating goods or services using various factors of production.", "example": "A factory manufacturing cars converts raw materials and labor into finished vehicles.", "category": "Basic Concepts" },
{ "name": "Consumption", "definition": "The use of goods and services to satisfy human wants or needs.", "example": "Buying groceries for home use represents consumption.", "category": "Basic Concepts" },
{ "name": "Exchange", "definition": "The process by which goods or services are traded between parties, often using money as a medium.", "example": "A farmer selling vegetables to a grocery store in exchange for cash exemplifies exchange.", "category": "Basic Concepts" },
{ "name": "Distribution", "definition": "The way in which total output, income, or wealth is shared among individuals or groups in society.", "example": "Taxes collected by the government are redistributed in the form of public services and welfare.", "category": "Basic Concepts" },
{ "name": "Specialization", "definition": "The focus on producing a limited range of goods or services to increase efficiency and expertise.", "example": "A chef specializing in pastries rather than general cooking increases productivity and skill.", "category": "Basic Concepts" }, 
{ "name": "Division of labor", "definition": "The separation of tasks in a production process to improve efficiency and productivity.", "example": "In a car assembly line, one worker installs engines while another fits doors, exemplifying division of labor.", "category": "Basic Concepts" }, 
{ "name": "Barter", "definition": "The direct exchange of goods and services without using money.", "example": "Trading a bag of rice for a carton of eggs in a village market is a barter transaction.", "category": "Basic Concepts" }, 
{ "name": "Money", "definition": "A universally accepted medium of exchange that facilitates trade, serves as a store of value, and a unit of account.", "example": "Using cash or digital currency to purchase groceries illustrates money in action.", "category": "Basic Concepts" }, 
{ "name": "Microeconomics", "definition": "The branch of economics that studies individual agents such as households, firms, and markets, focusing on decision-making and resource allocation.", "example": "Analyzing how a bakery sets prices for bread based on local demand is microeconomics.", "category": "Microeconomics" },
{ "name": "Demand", "definition": "The quantity of a good or service that consumers are willing and able to purchase at different prices over a period of time.", "example": "If the price of smartphones drops, more consumers may buy them, illustrating demand.", "category": "Microeconomics" },
{ "name": "Supply", "definition": "The quantity of a good or service that producers are willing and able to sell at different prices over a period of time.", "example": "A farmer supplies more wheat to the market when prices rise.", "category": "Microeconomics" }, 
{ "name": "Law of demand", "definition": "The principle stating that, ceteris paribus, as the price of a good rises, the quantity demanded decreases, and vice versa.", "example": "When movie ticket prices increase, fewer people attend screenings.", "category": "Microeconomics" }, 
{ "name": "Law of supply", "definition": "The principle stating that, ceteris paribus, as the price of a good rises, the quantity supplied increases, and vice versa.", "example": "A manufacturer produces more smartphones when market prices rise.", "category": "Microeconomics" },
{ "name": "Market equilibrium", "definition": "A situation in which the quantity demanded equals the quantity supplied, resulting in a stable market price.", "example": "If 1000 apples are demanded and 1000 are supplied at $2 each, the market is in equilibrium.", "category": "Microeconomics" }, 
{ "name": "Excess demand", "definition": "A situation where the quantity demanded of a good exceeds the quantity supplied at a given price, creating a shortage.", "example": "During a popular concert ticket sale, demand exceeds the available seats, resulting in excess demand.", "category": "Microeconomics" }, 
{ "name": "Excess supply", "definition": "A situation where the quantity supplied of a good exceeds the quantity demanded at a given price, creating a surplus.", "example": "Farmers produce more corn than consumers buy, leading to excess supply.", "category": "Microeconomics" },
{ "name": "Price mechanism", "definition": "The system where prices adjust to reflect scarcity and demand, guiding the allocation of resources.", "example": "Rising prices for coffee beans signal producers to supply more, while consumers may buy less.", "category": "Microeconomics" },
{ "name": "Elasticity", "definition": "A measure of how responsive the quantity demanded or supplied is to changes in price or other factors.", "example": "Luxury cars have high price elasticity because demand drops significantly when prices rise.", "category": "Microeconomics" }, 
{ "name": "Price elasticity of demand", "definition": "The percentage change in quantity demanded resulting from a one percent change in price.", "example": "If a 10% increase in movie ticket price reduces attendance by 20%, the price elasticity of demand is -2.", "category": "Microeconomics" },
{ "name": "Price elasticity of supply", "definition": "The percentage change in quantity supplied resulting from a one percent change in price.", "example": "If a 5% increase in the price of wheat leads to a 10% increase in quantity supplied, the supply is elastic.", "category": "Microeconomics" },
{ "name": "Income elasticity of demand", "definition": "The responsiveness of quantity demanded to a change in consumer income.", "example": "When consumers’ income rises, they may buy more organic food, showing positive income elasticity.", "category": "Microeconomics" }, 
{ "name": "Cross elasticity of demand", "definition": "The responsiveness of the demand for one good to a change in the price of another good.", "example": "If the price of tea rises and people buy more coffee, coffee and tea have positive cross elasticity.", "category": "Microeconomics" },
{ "name": "Consumer surplus", "definition": "The difference between what consumers are willing to pay and what they actually pay for a good or service.", "example": "If a person is willing to pay $50 for a concert ticket but buys it for $30, the consumer surplus is $20.", "category": "Microeconomics" },
{ "name": "Producer surplus", "definition": "The difference between the price producers receive and the minimum they would accept to supply a good or service.", "example": "A farmer willing to sell wheat for $100 earns $150 when the market price is $150, yielding a producer surplus of $50.", "category": "Microeconomics" },
{ "name": "Indifference curve", "definition": "A curve representing combinations of two goods that provide equal satisfaction to a consumer.", "example": "A consumer is equally happy with either 3 apples and 2 oranges or 2 apples and 3 oranges, lying on the same indifference curve.", "category": "Microeconomics" }, 
{ "name": "Budget line", "definition": "A line showing all possible combinations of two goods that a consumer can afford given their income and prices.", "example": "If a consumer has $50 and apples cost $5 and oranges $10, the budget line shows all affordable combinations.", "category": "Microeconomics" }, 
{ "name": "Isoquant", "definition": "A curve representing all combinations of two inputs, such as labor and capital, that produce the same level of output.", "example": "A factory can produce 100 units using either 5 workers and 10 machines or 10 workers and 5 machines, both lying on the same isoquant.", "category": "Microeconomics" },
{ "name": "Total cost", "definition": "The sum of all costs incurred in producing a given level of output, including fixed and variable costs.", "example": "A bakery’s total cost includes rent, wages, and the cost of ingredients for the month.", "category": "Costs & Production" }, 
{ "name": "Average cost", "definition": "The total cost of production divided by the quantity of output produced.", "example": "If producing 100 chairs costs $5000, the average cost per chair is $50.", "category": "Costs & Production" }, 
{ "name": "Marginal cost", "definition": "The additional cost incurred from producing one more unit of output.", "example": "If producing the 101st chair increases total cost from $5000 to $5050, the marginal cost is $50.", "category": "Costs & Production" }, 
{ "name": "Fixed cost", "definition": "Costs that do not change with the level of output produced, such as rent or salaries.", "example": "A factory pays $2000 monthly rent regardless of how many goods it produces.", "category": "Costs & Production" },
{ "name": "Variable cost", "definition": "Costs that vary directly with the level of production, such as raw materials or hourly wages.", "example": "The cost of flour for a bakery increases with the number of cakes baked.", "category": "Costs & Production" }, 
{ "name": "Short-run", "definition": "The period in which at least one factor of production is fixed and cannot be changed.", "example": "A factory cannot expand its building immediately, so labor adjustments are made in the short run.", "category": "Costs & Production" },
{ "name": "Long-run", "definition": "The period in which all factors of production can be varied, allowing firms to adjust fully to changes in demand.", "example": "A car manufacturer can build new factories or buy more machines in the long run to increase production.", "category": "Costs & Production" }, 
{ "name": "Economies of scale", "definition": "The cost advantages a firm experiences as it increases production, leading to lower average costs per unit.", "example": "A factory producing 10,000 shirts has a lower average cost per shirt than when producing 1,000 shirts due to bulk purchasing.", "category": "Costs & Production" }, 
{ "name": "Diseconomies of scale", "definition": "The increase in average costs that occurs when a firm becomes too large and inefficient.", "example": "A multinational company faces higher coordination costs, raising average costs per product.", "category": "Costs & Production" },
{ "name": "Law of diminishing returns", "definition": "As more of a variable input is added to fixed inputs, the additional output produced eventually decreases.", "example": "Adding more workers to a small bakery leads to overcrowding, reducing the extra output per worker.", "category": "Costs & Production" }, 
{ "name": "Perfect competition", "definition": "A market structure characterized by many buyers and sellers, homogeneous products, and free entry and exit.", "example": "Local farmers selling identical vegetables in an open market operate in a nearly perfectly competitive market.", "category": "Market Structures" },
{ "name": "Monopoly", "definition": "A market structure where a single firm controls the entire supply of a good or service with no close substitutes.", "example": "A local water utility providing water to a city without competition is a monopoly.", "category": "Market Structures" },
{ "name": "Oligopoly", "definition": "A market structure dominated by a few large firms, often with significant barriers to entry.", "example": "The airline industry in many countries is an oligopoly, with a small number of major carriers controlling most of the market.", "category": "Market Structures" }, 
{ "name": "Monopolistic competition", "definition": "A market structure with many firms offering differentiated products and some control over pricing.", "example": "Restaurants in a city serve similar food but differentiate through branding, menu, and service.", "category": "Market Structures" },
{ "name": "Price taker", "definition": "A firm that must accept the market price and cannot influence it due to perfect competition.", "example": "A wheat farmer selling to a large commodity market accepts the prevailing market price.", "category": "Market Structures" },
{ "name": "Price maker", "definition": "A firm that has the ability to influence the price of its product due to market power.", "example": "A software company with a unique product can set its own price, acting as a price maker.", "category": "Market Structures" },
{ "name": "Cartel", "definition": "A formal agreement among competing firms to control prices, production, or market share.", "example": "OPEC, the oil-producing countries’ organization, coordinates oil output to influence global prices.", "category": "Market Structures" }, 
{ "name": "Collusion", "definition": "When firms secretly agree to limit competition, fix prices, or divide markets to increase profits.", "example": "Two competing airlines secretly agreeing to raise ticket prices exemplify collusion.", "category": "Market Structures" },
{ "name": "Kinked demand curve", "definition": "A demand curve for an oligopolistic firm that is more elastic for price increases than for price decreases, leading to price rigidity.", "example": "A soda company may not lower prices fearing competitors’ matching, but raising prices could lose customers quickly.", "category": "Market Structures" }, 
{ "name": "Price discrimination", "definition": "The practice of charging different prices to different consumers for the same product, based on willingness to pay.", "example": "Movie theaters charge students lower ticket prices than adults for the same screening.", "category": "Market Structures" }, 
{ "name": "Revenue", "definition": "The total income a firm receives from selling goods or services before any costs are deducted.", "example": "A bookstore earns $10,000 in revenue from selling books in a month.", "category": "Firm Theory" }

]